In [7]:
import pandas as pd

df = pd.read_csv("sample/자동차_제원_정보.csv",header=None)

#열 이름 지정

df.columns = ['연비','실린더 수','배기량','마력','중량','엑셀','년식','제조국','차종']

print(df.head())
print()

print('0은 행의 갯수',df.shape[0],'개')

     연비  실린더 수    배기량     마력      중량    엑셀  년식  제조국                         차종
0  18.0      8  307.0  130.0  3504.0  12.0  70    1  chevrolet chevelle malibu
1  15.0      8  350.0  165.0  3693.0  11.5  70    1          buick skylark 320
2  18.0      8  318.0  150.0  3436.0  11.0  70    1         plymouth satellite
3  16.0      8  304.0  150.0  3433.0  12.0  70    1              amc rebel sst
4  17.0      8  302.0  140.0  3449.0  10.5  70    1                ford torino

0은 행의 갯수 398 개

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   연비      398 non-null    float64
 1   실린더 수   398 non-null    int64
 2   배기량     398 non-null    float64
 3   마력      398 non-null    object
 4   중량      398 non-null    float64
 5   엑셀      398 non-null    float64
 6   년식      398 non-null    int64
 7   제조국     398 non-null    int64
 8   차종      398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

In [10]:
df.dtypes

연비       float64
실린더 수      int64
배기량      float64
마력        object
중량       float64
엑셀       float64
년식         int64
제조국        int64
차종        object
dtype: object

In [11]:
df.describe

<bound method NDFrame.describe of        연비  실린더 수    배기량     마력      중량    엑셀  년식  제조국  \
0    18.0      8  307.0  130.0  3504.0  12.0  70    1
1    15.0      8  350.0  165.0  3693.0  11.5  70    1
2    18.0      8  318.0  150.0  3436.0  11.0  70    1
3    16.0      8  304.0  150.0  3433.0  12.0  70    1
4    17.0      8  302.0  140.0  3449.0  10.5  70    1
..    ...    ...    ...    ...     ...   ...  ..  ...
393  27.0      4  140.0  86.00  2790.0  15.6  82    1
394  44.0      4   97.0  52.00  2130.0  24.6  82    2
395  32.0      4  135.0  84.00  2295.0  11.6  82    1
396  28.0      4  120.0  79.00  2625.0  18.6  82    1
397  31.0      4  119.0  82.00  2720.0  19.4  82    1

                            차종
0    chevrolet chevelle malibu
1            buick skylark 320
2           plymouth satellite
3                amc rebel sst
4                  ford torino
..                         ...
393            ford mustang gl
394                  vw pickup
395              dodge rampage
396                ford ranger
397                 chevy s-10

[398 rows x 9 columns]>

In [12]:
df.describe(include='all')

,연비,실린더 수,배기량,마력,중량,엑셀,년식,제조국,차종
count,398.000000,398.000000,398.000000,398,398.000000,398.000000,398.000000,398.000000,398
unique,NaN,NaN,NaN,94,NaN,NaN,NaN,NaN,305
top,NaN,NaN,NaN,150.0,NaN,NaN,NaN,NaN,ford pinto
freq,NaN,NaN,NaN,22,NaN,NaN,NaN,NaN,6
mean,23.514573,5.454774,193.425879,NaN,2970.424623,15.568090,76.010050,1.572864,NaN
std,7.815984,1.701004,104.269838,NaN,846.841774,2.757689,3.697627,0.802055,NaN
min,9.000000,3.000000,68.000000,NaN,1613.000000,8.000000,70.000000,1.000000,NaN
25%,17.500000,4.000000,104.250000,NaN,2223.750000,13.825000,73.000000,1.000000,NaN
50%,23.000000,4.000000,148.500000,NaN,2803.500000,15.500000,76.000000,1.000000,NaN
75%,29.000000,8.000000,262.000000,NaN,3608.000000,17.175000,79.000000,2.000000,NaN
max,46.600000,8.000000,455.000000,NaN,5140.000000,24.800000,82.000000,3.000000,NaN

In [13]:
df.count()

연비       398
실린더 수    398
배기량      398
마력       398
중량       398
엑셀       398
년식       398
제조국      398
차종       398
dtype: int64

In [19]:
unique_values = df['제조국'].value_counts()
unique_values

1    249
3     79
2     70
Name: 제조국, dtype: int64

In [18]:
type(unique_values)

pandas.core.series.Series

In [21]:
df.제조국.dtype

dtype('int64')

In [22]:
df.mean()

C:\Users\user\AppData\Local\Temp\ipykernel_7236\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

연비         23.514573
실린더 수       5.454774
배기량       193.425879
중량       2970.424623
엑셀         15.568090
년식         76.010050
제조국         1.572864
dtype: float64

In [23]:
df.연비.mean()

23.514572864321607

In [24]:
df.median()

C:\Users\user\AppData\Local\Temp\ipykernel_7236\530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

연비         23.0
실린더 수       4.0
배기량       148.5
중량       2803.5
엑셀         15.5
년식         76.0
제조국         1.0
dtype: float64

In [25]:
df.mode()

     연비  실린더 수   배기량     마력      중량    엑셀    년식  제조국          차종
0  13.0    4.0  97.0  150.0  1985.0  14.5  73.0  1.0  ford pinto
1   NaN    NaN   NaN    NaN  2130.0   NaN   NaN  NaN         NaN

In [26]:
df.max()

연비                   46.6
실린더 수                   8
배기량                 455.0
마력                      ?
중량                 5140.0
엑셀                   24.8
년식                     82
제조국                     3
차종       vw rabbit custom
dtype: object

In [28]:
df.min()

연비                           9.0
실린더 수                          3
배기량                         68.0
마력                         100.0
중량                        1613.0
엑셀                           8.0
년식                            70
제조국                            1
차종       amc ambassador brougham
dtype: object

In [29]:
df.mad()

연비         6.533396
실린더 수      1.547524
배기량       91.352636
중량       717.921555
엑셀         2.142570
년식         3.176738
제조국        0.716800
dtype: float64

In [30]:
df.std()

C:\Users\user\AppData\Local\Temp\ipykernel_7236\3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

연비         7.815984
실린더 수      1.701004
배기량      104.269838
중량       846.841774
엑셀         2.757689
년식         3.697627
제조국        0.802055
dtype: float64

In [31]:
df.var()

C:\Users\user\AppData\Local\Temp\ipykernel_7236\1568254755.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.var()

연비           61.089611
실린더 수         2.893415
배기량       10872.199152
중량       717140.990526
엑셀            7.604848
년식           13.672443
제조국           0.643292
dtype: float64

In [32]:
df.corr()

             연비     실린더 수       배기량        중량        엑셀        년식       제조국
연비     1.000000 -0.775396 -0.804203 -0.831741  0.420289  0.579267  0.563450
실린더 수 -0.775396  1.000000  0.950721  0.896017 -0.505419 -0.348746 -0.562543
배기량   -0.804203  0.950721  1.000000  0.932824 -0.543684 -0.370164 -0.609409
중량    -0.831741  0.896017  0.932824  1.000000 -0.417457 -0.306564 -0.581024
엑셀     0.420289 -0.505419 -0.543684 -0.417457  1.000000  0.288137  0.205873
년식     0.579267 -0.348746 -0.370164 -0.306564  0.288137  1.000000  0.180662
제조국    0.563450 -0.562543 -0.609409 -0.581024  0.205873  0.180662  1.000000

# 메서드 매핑

In [49]:
import seaborn as sns

titanic = sns.load_dataset("titanic")
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [50]:
df = titanic.loc[:,['age','fare']]

In [51]:
df.ten = 10

In [52]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [53]:
def add_ten(df):
    return df+10
def two_object(a,b):
    return a+b

print(add_ten(10))
print()
print(two_object(10,10))

print(df.age.head(10))
print()
series1 = df.age.apply(add_ten)
print(series1.head(10))
print()

20

20
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
5     NaN
6    64.0
7    12.0
8    37.0
9    24.0
Name: age, dtype: float64